Repository: JosePrietoPaez/CalcDiv
Catalog: ModoDirecto/Recursos/TextoEjecucion.*.resx
Languages: es

# EjemploReglaVarias
source: Find non-coefficient rules for 7, 100 and 41 in bases 10 and 8 and apply the rules using 6342 and 289
es: Encuentra reglas sin coeficientes para 7, 100, 41 en las bases 10 y 8 y aplicar las reglas con 6342 y 289

# EjemploReglaDialogo
source: Start dialog with application to find rules
es: Comenzar un dialogo con la aplicación para buscar reglas

# EjemploReglaJsonExtendido
source: Find non-coefficient rule for thirteen in base sixteen and output as JSON
es: Encontrar una regla sin coeficientes para trece en base dieciséis y mostrar como JSON

# EjemploReglaUno
source: Find rule for seven in base twelve, using two coefficients
es: Encontrar la regla de siete en base doce, usando dos coeficientes

# ErrorBase
source: The base must be an integer greater than one.
es: La base debe ser un entero mayor que uno.

# DirectoReferirExtendidoErrorInesperado
source: Cannot calculate this rule due to an unexpected error, try running with -x option, like:
es: No se puede calcular una regla de coeficientes debido a un error inesperado, pruebe a ejecutar con la opción -x, por ejemplo:

# DirectoReferirExtendidoPotencias
source: Cannot calculate coefficient rule, the divisor is composed of the prime factors of the base, a rule can be calculated running with -x option, like:
es: No se puede calcular una regla de coeficientes, el divisor está compuesto de los factores primos de la base, para obtener una regla en este caso ejecute con la opción -x, por ejemplo:

# DirectoReferirExtendidoUsable
source: Coefficient rule can be calculated, however, in this case it is recommended to run with -x option, like:
es: Se puede calcular una regla de coeficientes, pero en estos casos se recomienda ejecutar con la opción -x, por ejemplo:

# DirectoReferirExtendidoValido
source: Coefficient rule can be calculated, in this case it is not recommended to use the -x option.
es: Se puede calcular la regla de coeficientes, en este caso no se recomienda usar la opción -x.

# VariasMensajeVacio
source: The rule wasn't calculated, should be caused bv the divisor and base not being coprime. This rule can be ignored.
es: La regla no se calculó, seguramente sea causado porque el divisor no sea coprimo con la base. Puede ignorar esta regla.

# VariasMensajeError
source: Some rules couldn't be calculated. Probably caused by a divisor, base pair not being coprime. Check the error stream for more information.
es: No se pudieron calcular algunas reglas. Probablemente causado por algún par divisor, base no coprimo. Compruebe la salida de errores para obtener más información.

# VariasMensajeErrorTotal
source: No rules were calculated. Might be caused by none of the divisors being coprime with the bases. Check the error stream for more information.
es: No se pudo calcular ninguna regla. Puede ser debido a que ningún divisor sea coprimo con la base. Compruebe la salida de errores para obtener más información.

# Ayuda
source: CalcDivCLI Help: - Program options per verb: use --help for information on the available verbs. * General options, except for manual: * -j, --json: Outputs the rule as JSON. * -d, --dividend: Applies and explains all rules obtained using the integers passed to it, separated by commas. * -c, --coefficient-rules: Will attempt to find a coefficient rule if possible. Bases and divisors will now have to be coprime. * --length: Sets the amount of coefficients in coefficient rules. Must be a positive integer. * single (default): * Arguments: This verbs uses two positional arguments. * Divisor: Mandatory. Rules will test divisibility by this number. * Base: Optional, defaults to ten. Rules will be applied in this base. * multiple: * Arguments: This verbs uses two positional arguments. * Divisors: Mandatory. Rules will test divisibility by these numbers. The different divisors must be separated by commas. * Base: Optional, defaults to a single ten. Rules will be applied in these bases. The different bases must be separated by commas. * dialog: * --divisor: Skips inputting the divisor and forces this value. * --base: Skips inputting the base and forces this value. * --no-loop: Forces a single execution of this application. * --skip-explanation: Always skips the application of the rule. * -s, --simple-dialog: Stops other options from being inputted and only asks for the arguments for the rule. * If any other option is active, they will be used and the application will act as if -s was activated. - Output values 0: successful execution. 1: there were invalid arguments. 2: there was an error parsing the options or arguments. 3: the user quit during dialog. 4: could not find a non-coefficient rule. 5: multiple rules were requested, some weren't calculated. 6: multiple rules were requested, none were calculated.
es: Ayuda de CalcDivCLI: - Opciones del programa por verbo: use --help para más información de los verbos disponibles. * Opciones generales, excepto manual: * -j, --json: La salida de las reglas se genera en JSON. * -d, --dividend: Aplica y explica todas las reglas obtenidas usando los enteros que se les ha pasado, separados por comas. * -c, --coefficient-rules: Intentará encontrar una regla que sea de coeficientes si es posible. Las bases y coeficientes tendrán que ser coprimos. * --length: Establece la longitud de las reglas de coeficientes. Debe ser un entero positivo. * single (default): * Arguments: Este verbo usa dos argumentos posicionales. * Divisor: Obligatorio. Las reglas probarán la divisibilidad con este número. * Base: Opcional, diez por defecto. Las reglas se aplicarán en esta base. * multiple: * Arguments: Este verbo usa dos argumentos posicionales. * Divisor: Obligatorio. Las reglas probarán la divisibilidad con estos números. Separados por comas. * Base: Opcional, diez por defecto. Las reglas se aplicarán en estas bases. Separados por comas. * dialog: * --divisor: Salta la pregunta del divisor y fuerza este valor. * --base: Salta la pregunta de la base y fuerza este valor. * --no-loop: Fuerza a que se ejecute un única iteración. * --skip-explanation: Siempre se salta la confirmación de la aplicación de la regla. * -s, --simple-dialog: Impide que se pregunten por otras opciones y se limita a preguntar por los argumentos de la regla. * Si cualquier otra opción activa, se utilizarán y se actuará como si -s estuviera activa. - Mensajes de salida 0: el programa se ha ejecutado de forma correcta. 1: no todos los datos introducidos fueron correctos. 2: se han introducido argumentos de forma errónea. 3: el usuario ha cerrado el programa de forma voluntaria. 4: se pidió una regla sin coeficientes, pero no se pudo encontrar. 5: se pidieron varias reglas, pero no todas se calcularon. 6: se pidieron varias reglas, pero ninguna se calculó.

# AyudaCorta
source: - Usage: CalcDivCLI.exe [-&lt;short option name&gt;|--&lt;long option name&gt; [&lt;mandatory arguments ...&gt; [&lt;optional arguments&gt;...]] Example: *CalcDiv.exe single 7 10 --dividend 75 --json* Equivalent to: *CalcDiv.exe single -jd 75* Calculates the divisibility rule of 7 in base 10, outputs it in JSON and applies it to 75. Use --help for more information about options and arguments.
es: - Plantilla de uso: CalcDivCLI.exe [-<nombre de opción corto>|--<nombre de opción largo> [<argumentos obligatorios ...> [<argumentos opcionales>...]] Ejemplo: *CalcDiv.exe --json --direct-output 7 10 --named-rule Nombre* Equivalente a: *CalcDiv.exe -jd 7 10 -n Nombre* Calcula la regla de 7 en base 10, le da el nombre Nombre y lo escribe en JSON. Use --help para ver información de las opciones y argumentos o -H para ver más información sobre la aplicación.

# ErrorBaseCoprima
source: The base must be an integer greater than one and coprime with the divisor.
es: La base debe ser un entero mayor que uno y coprima con el divisor.

# ErrorCoeficientes
source: The number of coefficients must be a positive integer.
es: El número de coeficientes debe ser un entero positivo.

# ErrorDivisor
source: The divisor must be a non-negative integer. Keep in mind that numbers divisible by a negative number are divisible by its absolute value.
es: El divisor debe ser un entero no negativo. Tenga en cuenta que los números divisibles entre un número negativo son divisibles entre su valor absoluto.

# ErrorDivisorCoprimo
source: The divisor must be a positive integer greater than one and coprime with the base. Two numbers are coprime if their greatest common divisor is greater than one.
es: El divisor debe ser un entero positivo mayor que uno y coprimo con la base. Dos números son coprimos si su máximo común divisor es mayor que uno.

# ErrorDivisorExtra
source: The divisor must be a non-negative integer.
es: El divisor debe ser un entero no negativo.

# ErrorNumerico
source: The divisor, the base and coefficient amount must be positive integers.
es: El divisor, la base y el número de coeficientes deben ser números enteros positivos.

# ErrorPrimo
source: The divisor and the base are not coprime. Calculating a coefficient in this case will not be implemented. Run this program with the option-x to obtain a different type of rule, or activate it in dialog mode.
es: El divisor y la base no son coprimos. El cálculo de reglas de coeficientes en este caso no será implementado. Ejecute este programa con la opción -x o actívela en el diálogo para obtener una regla de otro tipo.

# ErrorPrimoExtra
source: The divisor and the base are not coprime. Calculating a coefficient in this case will not be implemented.
es: El divisor y la base no son coprimos. El cálculo de reglas de coeficientes en este caso no sera implementado.

# ErrorReglaNula
source: A rule was null when calculated, cannot continue execution.
es: Una regla fue nula al calcularla, no se puede seguir con la ejecución.

# ObjetoNuloMensaje
source: Object is null.
es: El objeto es nulo.

# HelpVerbDialog
source: Starts a dialog to create divisibility rules.
es: Inicia un diálogo para crear reglas de divisibilidad.

# HelpVerbHelp
source: Outputs the help for this application.
es: Muestra la ayuda de esta aplicación.

# HelpVerbManual
source: Outputs a more detailed help document.
es: Muestra un documento de ayuda con más detalles.

# HelpVerbSingle
source: Outputs a single rule given its divisor, base and length, if it is a coefficient rule.
es: Genera una única regla dado un divisor, su base y su longitud si la regla es de coeficientes.

# HelpAnularBucle
source: Cancels dialog mode's looping behavior. Will one calculate rules once.
es: Anula el bucle del modo diálogo. Solo hará un calculo de reglas.

# HelpAyuda
source: Outputs a longer help document explaining this application more in-depth.
es: Devuelve por salida un documento de ayuda más largo explicando la aplicación con más detalle.

# HelpAyudaCorta
source: Outputs short document with information on how to run this program.
es: Devuelve por salida un pequeño documento indicando como ejecutar esta aplicación.

# HelpBase
source: Sets a value for the base the rule will be applied in. Defaults to ten, must be greater than one.
es: Indica la base en la que se aplicará la regla. Por defecto diez, debe ser mayor que uno.

# HelpBaseDialogo
source: Sets a default base for dialog, skipping input. Must be a valid integer greater than 1.
es: Inicializa un valor para la base en modo diálogo, salta la pregunta por consola. Debe ser un entero de 64 bits válido mayor que 1.

# HelpDirecto
source: The divisor, base, and optionally the number of coefficients as arguments, not as dialog input.
es: La base, divisor y, opcionalmente la longitud de las reglas de coeficientes, como argumentos en lugar de preguntarlos en modo diálogo.

# HelpDividendo
source: Sets the dividends to apply the rule is successfully obtained. Must be valid 64-bit integers separated by commas. The absolute value will be used, this does not affect the result.
es: Indica los valores de los dividendos a los que se les aplicará la regla. Deben ser enteros de 64 bits válidos separados por comas. Se usarán sus valores absolutos, esto no afecta al resultado.

# HelpDivisor
source: Sets the divisor to find its divisibility rule. Obligatory, must be a valid 64-bit non-negative integer.
es: Indica el divisor usado para encontrar su regla de divisibilidad. Obligatorio, debe ser un entero de 64 bits no negativo válido.

# HelpDivisorDialogo
source: Sets a default divisor for dialog, skipping input. Must be a valid 64-bit non-negative integer. If the base is specified, will default to extra rules, unless the divisor and base are coprime.
es: Inicializa un valor para el divisor en modo diálogo, salta la pregunta por consola. Debe ser un entero válido no negativo. Si se especifica la base, se activarán las reglas extra, a no ser que la base y el divisor sean coprimos.

# HelpDivisorVarias
source: Sets the divisor to find its divisibility rule. Obligatory, must be a list of valid 64-bit non-negative integers.
es: Indica el divisor usado para encontrar su regla de divisibilidad. Obligatorio, debe ser una lista de enteros de 64 bits no negativos válidos.

# HelpExtendido
source: May return other types of rules, also outputs explanations on how to apply them.
es: Puede devolver reglas de tipos distintos, también devuelve por pantalla explicaciones sobre como se aplican.

# HelpJson
source: Outputs coefficient rule as a JSON object, changes made by other flags are not ignored.
es: Las reglas de coeficientes se devolveran como un objeto JSON, se reflejarán los cambios causados por otros flags.

# HelpLongitud
source: Sets a value for the length of the rule if it is a coefficient rule. Defaults to one, must be a valid positive 32-bit integer.
es: Indica la longitud de la regla si es de coeficientes. Por defecto uno, debe ser un entero positivo de 32 bits válido.

# HelpLongitudDialogo
source: Sets a default rule length for dialog, skipping input. Must be a valid 32-bit positive integer. Defaults to coefficient rules, unless extra rules are activated.
es: Inicializa la longitud de las reglas en modo diálogo, salta la pregunta por consola. Debe ser un entero positivo válido. Activa las reglas de coeficientes, a no ser que se activen las extra.

# HelpNombre
source: Gives the coefficient rule a name, which is included in its output.
es: Le da un nombre a las reglas de coeficientes, incluido en la salida.

# HelpSaltar
source: Without any other options, skips dialogue related to other options, does not affect output.
es: Si no se usan otras opciones, salta el dialogo relacionado con el resto de opciones, no afecta a la salida.

# HelpTextMultiple
source: Outputs all the valid combinations of rules given a list of divisors, bases and lengths if they are coefficient rules. The elements in the same lists are separated by commas.
es: Devuelve todas las combinaciones válidas de reglas dadas unas listas de divisores, bases y longitudes si son reglas de coeficientes. Los elementos de una misma lista deben estar separados por una coma.

# HelpTodos
source: Outputs all coefficient rules with elements whose absolute value is less than the divisor.
es: Devuelve todas las reglas con valores absolutos menores al divisor elegido.

# HelpVarias
source: Recieves multiple bases, divisors and coefficients as arguments and outputs the rule formed by every (divisor,base,coefficient) tuple. All bases, divisors and coefficients must be valid. Activates direct output mode.
es: Recibe varias bases, divisores y coeficientes como argumentos y devuelve la regla de cada tupla (divisor, base, coeficiente). Todas las bases, divisores y coeficientes deben ser válidos. Activa el modo directo.

# HelpExplicacion
source: Skips rule explanation and application confirmation in dialog mode and skips to repetition confirmation if not disabled.
es: Omite la confirmación de explicación y aplicación de la regla obtenida en modo diálogo y salta a la confirmación de repetir, si no se ha desactivado.
