Repository: JosePrietoPaez/CalcDiv
Catalog: ProgramaDivisibilidadCLI/Recursos/TextoResource.*.resx
Languages: es

# ErrorNumerico
source: The divisor, the base and coefficient amount must be positive integers.
es: El divisor, la base y el número de coeficientes deben ser números enteros positivos.

# ErrorPrimo
source: The divisor and the base are not coprime. Calculating a coefficient in this case will not be implemented. Run this program with the option-x to obtain a different type of rule, or activate it in dialog mode.
es: El divisor y la base no son coprimos. El calculo de reglas de coeficientes en este caso no será implementado. Ejecute este programa con la opción -x o actívela en el diálogo para obtener una regla de otro tipo.

# HelpAyuda
source: Outputs a longer help document explaining this application more in-depth.
es: Devuelve por salida un documento de ayuda más largo explicando la aplicación con más detalle.

# HelpAyudaCorta
source: Outputs short document with information on how to run this program.
es: Devuelve por salida un pequeño documento indicando como ejecutar esta aplicación.

# HelpDirecto
source: Reads the divisor, base, and optionally the number of coefficients as arguments, not as dialog input. Must be two or three valid 64-bit integers.
es: Lee la base, divisor y, opcionalmente la longitud de las reglas de coeficientes, como argumentos en lugar de preguntarlos en modo diálogo. Deben ser enteros de 64 bits válidos.

# HelpExtendido
source: May return other types of rules, also outputs explanations on how to apply them, ignores all other flags, except -d.
es: Puede devolver reglas de tipos distintos, también devuelve por pantalla explicaciones sobre como se aplican. Ignora los demás flags, excepto -d.

# HelpJson
source: Outputs coefficient rule as a JSON object, changes made by other flags are not ignored.
es: Las reglas de coeficientes se devolveran como un objeto JSON, se reflejarán los cambios causados por otros flags.

# HelpNombre
source: Gives the coefficient rule a name, which is included in its output.
es: Le da un nombre a las reglas de coeficientes, incluido en la salida.

# HelpSaltar
source: Without any other options, skips dialogue related to other options, does not affect output.
es: Si no se usan otras opciones, salta el dialogo relacionado con el resto de opciones, no afecta a la salida.

# HelpTodos
source: Outputs all coefficient rules with elements whose absolute value is less than the divisor.
es: Devuelve todas las reglas con valores absolutos menores al divisor elegido.

# MensajeSalidaVoluntaria
source: Exit message has been detected, execution was interrupted.
es: Se ha detectado el mensaje de salida, se ha detenido el programa.

# MensajeParametrosDirecto
source: Divisor: {0}, Base: {1}, Coefficients: {2}.
es: Divisor: {0}, Base: {1}, Coeficientes: {2}.

# MensajeFinDirecto
source: The rule was calculated.
es: Se ha calculado la regla.

# MensajeDialogoExtendido
source: Type "s" to obtain coefficient rules, type a different letter to obtain rules:
es: Pulse <<s>> para obtener reglas de coeficientes u otra letra para otras reglas:

# MensajeDialogoJson
source: Type "s" to output the rule as a JSON, if the rule is not going to be parsed type another letter:
es: Pulse <<s>> para que la regla se escriba en un JSON, si la regla no va a ser pasada a un programa, pulse otra tecla:

# MensajeDialogoTodas
source: Type "s" to output all the rules derived from the original, type a different letter to obtain the minimum rule:
es: Pulse <<s>> para obtener todas las reglas derivadas de la original u otra letra obtener solo la menor:

# MensajeDialogoBase
source: Base of the rule:
es: Base de la regla:

# ErrorBase
source: The base must be an integer greater than one.
es: La base debe ser un entero mayor que uno.

# ErrorDivisor
source: The divisor must be a non-negative integer. Keep in mind that numbers divisible by a negative number are divisible by its absolute value.
es: El divisor debe ser un entero no negativo. Tenga en cuenta que los números divisibles entre un número negativo son divisibles entre su valor absoluto.

# ErrorDivisorCoprimo
source: The divisor must be a positive integer greater than one and coprime with the base. Two numbers are coprime if their greatest common divisor is greater than one.
es: El divisor debe ser un entero positivo mayor que uno y coprimo con la base. Dos números son coprimos si su máximo común divisor es mayor que uno.

# MensajeDialogoDivisor
source: Divisor of the rule:
es: Divisor de la regla:

# MensajeDialogoCoeficientes
source: Number of coefficients in the rule:
es: Número de coeficientes de la regla:

# ErrorCoeficientes
source: The number of coefficients must be a positive integer.
es: El número de coeficientes debe ser un entero positivo.

# MensajeInicioDialogo
source: You will be asked to input data throught the console, write {0} to interrupt the program.
es: Se pedirá que introduzca los datos por consola, escriba {0} para interrumpir el programa.

# MensajeDialogoRegla
source: Name of the rule, can be left empty:
es: Nombre de la regla, puede dejarse vacío:

# MensajeDialogoResultado
source: Obtained the following rule:
es: Regla obtenida:

# MensajeDialogoRepetir
source: Type "s" to calculate another rule:
es: Pulse <<s>> para calcular otra regla:

# MensajeDialogoInterrumpido
source: The program was interrupted.
es: Se ha interrumpido el programa.

# SentenceBadFormatConversionErrorOption
source: Option '{0}' is defined in the wrong format.
es: Opción '{0}' está definida en un formato erróneo.

# SentenceBadFormatConversionErrorValue
source: A value not bound to option name is defined with a bad format.
es: Valor separado de una opción está definido en un formato erróneo.

# SentenceBadFormatTokenError
source: Token '{0}' is not recognized.
es: Elemento '{0}' no se reconoce.

# SentenceBadVerbSelectedError
source: Verb '{0}' is not recognized.
es: Verbo '{0}' no se reconoce. (Este error no debería aparecer).

# SentenceErrorsHeadingText
source: ERROR(S):
es: ERROR(ES):

# SentenceHelpCommandTextOption
source: Display this help screen.
es: Mostrar esta pantalla de ayuda.

# SentenceHelpCommandTextVerb
source: Display more information on a specific command.
es: Mostrar más ayuda de un comando en concreto.

# SentenceMissingRequiredOptionError
source: Required option '{0}' is missing.
es: Opción obligatoria '{0}' no proporcionada.

# SentenceMissingRequiredValueError
source: A required value not bound to option name is missing.
es: Un valor no vinculado a un nombre de opción no se ha encontrado.

# SentenceMissingValueOptionError
source: Option '{0}' has no value.
es: Opción '{0}' no tiene valor.

# SentenceMutuallyExclusiveSetErrors
source: Options: {0} are not compatible with {1}.
es: Opciones: {0} no son compatibles con {1}.

# SentenceNoVerbSelectedError
source: No verb selected.
es: Ningún verbo seleccionado. (Este error no debería aparecer).

# SentenceRepeatedOptionError
source: Option '{0}' is defined multiple times.
es: Opción '{0}' definida varias veces.

# SentenceRequiredWord
source: Required.
es: Obligatorio.

# SentenceSequenceOutOfRangeErrorOption
source: A sequence option '{0}' is defined with fewer or more items than required.
es: Una opción de secuencia '{0}' se ha definido con menos elementos de los obligatorios.

# SentenceSequenceOutOfRangeErrorValue
source: A sequence value not bound to option name is defined with fewer items than required.
es: Valor de una secuencia no vinculada a un nombre de opción tiene menos elementos de los obligatorios.

# SentenceSetValueExceptionError
source: Error setting value to option '{0}': {1}
es: Error cambiando valor para la opción '{0}': {1}

# SentenceUnknownOptionError
source: Option '{0}' is unknown.
es: No se reconoce la opción '{0}'.

# SentenceUsageHeadingText
source: USAGE:
es: USO:

# SentenceVersionCommandText
source: Display version information.
es: Mostrar información de versión.

# OptionGroupWord
source: option
es: opción

# Ayuda
source: CalcDivCLI Help: - Usage: CalcDivCLI.exe [-<short option name>|--<long option name> [<mandatory arguments ...> [<optional arguments>...]] Example: *CalcDiv.exe --json --direct-output 7 10 --named-rule Nombre* Equivalent to: *CalcDiv.exe -jd 7 10 -n Nombre* Calculates the divisibility rule of 7 in base 10, gives it the name Nombre and outputs it in JSON. - Program options, can be concatenated after a dash: *CalcDiv.exe -ajd 3 4 1* o *CalcDiv.exe -H*, use --help for further info. -H: shows this message, ignores other options. -h: shows a summary of this message, ignores other options. -d: allows for the arguments to be passed in the command line instead of keyboard input. 2 or 3 arguments are passed: the divisor, base and optionally the rule length. -a: writes all possible rules using the given rule length, the coefficients' absolute value will be lower than the divisor. -n: writes the given name before every element or is included in the JSON output. -j: outputs the rule in JSON, unless -x is used. -x: outputs a different rule, also explains how to apply said rule. Possible cases are similar to the rules of 0, 1, 2, 3 and 11. -m: receives divisors and bases separated by commas and returns all the rules of every divisor,base pair. May also receive the length of the rules. All arguments and options must be valid. Options with arguments must not be followed by another option in the same combination, for example *CalcDivCLI.exe -na Nombre* is invalid, but the combination -an Nombre is valid. This program calculates divisibility rules of the given integers for any integer base larger than one. Rules are usually expressed as a list of coefficients, these are multiplied to the digits in the same position of a number, these products are added together and this sum is added to the rest of the digits. This rule is applied to the resulting number until we can see that it is a multiple of the divisor. The length of a rule can be given as an argument if -d is used without -x. To better understand we will apply the rule [-2, -3], obtained from the divisor 7 and base 10 on the number 1234. -First, we multiply 3 by -3 and 4 by -2, we get -6 and -12. -After that, we add these products to the rest of the number, in this case 12. The result is -6. Trivially, -6 is not a multiple of 7, therefore 1234 cannot be a multiple of 7. If we cannot determine whether the number is a multiple of the divisor, we apply the rule to the number we obtain until we can. - Output values 0: successful execution. 1: there were invalid arguments. 2: there was an error parsing the options or arguments. 3: the user quit during dialog. 4: could not find an alternative rule with -x. 5: multiple rules were requested, some weren't calculated. 6: multiple rules were requested, none were calculated.
es: Ayuda de CalcDivCLI: - Plantilla de uso: CalcDivCLI.exe [-<nombre de opción corto>|--<nombre de opción largo> [<argumentos obligatorios ...> [<argumentos opcionales>...]] Ejemplo: *CalcDiv.exe --json --direct-output 7 10 --named-rule Nombre* Equivalente a: *CalcDiv.exe -jd 7 10 -n Nombre* Calcula la regla de 7 en base 10, le da el nombre Nombre y lo escribe en JSON. - Opciones del programa, se concatenan sin el guion, por ejemplo: *CalcDiv.exe -ajd 3 4 1* o *CalcDiv.exe -H*, use --help para obtener más información. -H: escribe este mensaje por pantalla, ignora las otras opciones. -h: muestra una versión reducida de la ayuda, ignora las otras opciones. -d: si se pasan todos los datos se obtiene un resultado sin que la aplicación pida datos. -a: se escriben todas las reglas posibles con la cantidad de coeficientes proporcionado, el valor absoluto de los coeficientes será menor que el del divisor. -n: escribe el nombre introducido como parámetro antes de cada elemento con su indice. -j: escribe la regla como en JSON, a no ser que se use -x. -x: cambia la salida a una regla alternativa que no usa coeficientes y explica como usarla. Los casos disponibles son como las reglas de 0, 1, 2, 3 y 11. Todos los argumentos y opciones deben ser correctos. Las opciones con argumentos no pueden ir seguidas de otras opciones en una combinación, por ejemplo: *CalcDiv.exe -na Nombre* sería una llamada inválida, pero la combinación -an Nombre es válida. Este programa permite calcular reglas de divisibilidad de cualquier número natural positivo en cualquier base natural mayor que 1. Las reglas se expresan normalmente como una lista de coeficientes, estos se multiplican por las cifras en la misma posición de un número y son sumados al resto de número al que se aplique. La regla se aplica recursivamente hasta poder concluir si el número resultante es múltiplo del divisor. El número de coeficientes se puede introducir como argumento si se usa -d, pero no con -x. Por ejemplo, para la regla [-2,-3] con el divisor 7 en base 10, la usamos con 1234. -Primero, multiplicamos 3 por -3 y 4 por -2, obteniendo -6 y -12. -Después, le sumamos estos productos al resto del número, en este caso 12. El resultado es -6. Trivialmente, -6 no es múltiplo de 7, por lo tanto 1234 tampoco lo es. Si no es tan fácil ver si el resultado es múltiplo del divisor, se aplica la regla sobre el hasta llegar a una conclusión. - Mensajes de salida 0: el programa se ha ejecutado de forma correcta. 1: no todos los datos introducidos fueron correctos. 2: se han introducido argumentos de forma errónea. 3: el usuario ha cerrado el programa de forma voluntaria. 4: se pidió una regla alternativa con -x, pero no se pudo encontrar.

# AyudaCorta
source: - Usage: CalcDivCLI.exe [-&lt;short option name&gt;|--&lt;long option name&gt; [&lt;mandatory arguments ...&gt; [&lt;optional arguments&gt;...]] Example: *CalcDiv.exe --json --direct-output 7 10 --named-rule Nombre* Equivalent to: *CalcDiv.exe -jd 7 10 -n Nombre* Calculates the divisibility rule of 7 in base 10, gives it the name Nombre and outputs it in JSON. Use --help for more information about options and arguments or -H for more information about this application.
es: - Plantilla de uso: CalcDivCLI.exe [-<nombre de opción corto>|--<nombre de opción largo> [<argumentos obligatorios ...> [<argumentos opcionales>...]] Ejemplo: *CalcDiv.exe --json --direct-output 7 10 --named-rule Nombre* Equivalente a: *CalcDiv.exe -jd 7 10 -n Nombre* Calcula la regla de 7 en base 10, le da el nombre Nombre y lo escribe en JSON. Use --help para ver información de las opciones y argumentos o -H para ver más información sobre la aplicación.

# DirectoReferirExtendidoPotencias
source: Cannot calculate coefficient rule, the divisor is composed of the prime factors of the base, a rule can be calculated running with -x option, like:
es: No se puede calcular una regla de coeficientes, el divisor está compuesto de los factores primos de la base, para obtener una regla en este caso ejecute con la opción -x, por ejemplo:

# DirectoReferirExtendidoErrorInesperado
source: Cannot calculate this rule due to an unexpected error, try running with -x option, like:
es: No se puede calcular una regla de coeficientes debido a un error inesperado, pruebe a ejecutar con la opción -x, por ejemplo:

# DirectoReferirExtendidoUsable
source: Coefficient rule can be calculated, however, in this case it is recommended to run with -x option, like:
es: Se puede calcular una regla de coeficientes, pero en estos casos se recomienda ejecutar con la opción -x, por ejemplo:

# DirectoReferirExtendidoValido
source: Coefficient rule can be calculated, in this case it is not recommended to use the -x option.
es: Se puede calcular la regla de coeficientes, en este caso no se recomienda usar la opción -x.

# DialogoExcepcionInesperada
source: An unexpected error ocurred, consider creating a new Issue on GitHub if it isn't present, include the trace above and the arguments provided: https://github.com/JosePrietoPaez/CalcDiv/issues
es: Ha ocurrido un error inesperado, considere crear un Issue en GitHub si no existe, incluya la traza de error de arrbia y los argumentos del programa: https://github.com/JosePrietoPaez/CalcDiv/issues

# HelpVarias
source: Recieves multiple bases, divisors and coefficients as arguments and outputs the rule formed by every (divisor,base,coefficient) tuple. All bases, divisors and coefficients must be valid. Activates direct output mode.
es: Recibe varias bases, divisores y coeficientes como argumentos y devuelve la regla de cada tupla (divisor, base, coeficiente). Todas las bases, divisores y coeficientes deben ser válidos. Activa el modo directo.

# ErrorPrimoExtra
source: The divisor and the base are not coprime. Calculating a coefficient in this case will not be implemented.
es: El divisor y la base no son coprimos. El calculo de reglas de coeficientes en este caso no sera implementado.
