Repository: JosePrietoPaez/CalcDiv
Catalog: Operaciones/Recursos/TextoCalculos.*.resx
Languages: es

# CalculosCrearMensaje
source: An integer in base {0} will be divisible by {1} if
es: Un entero en base {0} será divisible entre {1} si

# CalculosExtendidaMensajeExceso
source: Error while calculating, might be too large
es: Resultado demasiado grande

# CalculosExtendidaMensajeFracaso
source: Could not find an alternative rule, apply the coefficient rule if possible.
es: No se ha encontrado ninguna regla alternativa, aplique la regla de coeficientes si se puede calcular.

# CalculosExtendidaMensajeCero
source: Divisibility cannot be applied to zero.
es: No se le puede aplicar la relación de divisibilidad a cero.

# CalculosExtendidaMensajeCifrasPrincipio
source: {0} is composed of powers of the prime factors of {1}.
es: {0} está compuesto de potencias de los factores primos de {1}.

# CalculosExtendidaMensajeCifrasFinal
source: its first {0} digits are a multiple of
es: sus primeras {0} cifras son múltiplo de

# CalculosExtendidaMensajeUno
source: All integers are divisible by one.
es: Todos los enteros son divisibles entre uno.

# CalculosExtendidaRestarPrincipio
source: {0} is a divisor of {1} to the power of {2} plus one ({3}).
es: {0} es divisor de {1} elevado a {2} más uno ({3}).

# CalculosExtendidaRestarFinal
source: after separating its digits in groups of {0} beginning at the unit digit, the difference of the sum of the even groups and the odd groups is a multiple of
es: al separar sus cifras en grupos de {0} desde las unidades, la diferencia de la suma de los grupos pares y la de los grupos impares es múltiplo de

# CalculosExtendidaSumarPrincipio
source: {0} is a divisor of {1} to the power of {2} minus one ({3}).
es: {0} es divisor de {1} elevado a {2} menos uno ({3}).

# CalculosExtendidaSumarFinal
source: after separating its digits in groups of {0} beginning at the unit digit, the sum of the groups is a multiple of
es: al separar sus cifras en grupos de {0} desde las unidades, la suma de los grupos es múltiplo de

# CalculosValorUnoRestarPrincipio
source: is a divisor of {0} plus one
es: es divisor de {0} más uno

# CalculosValorUnoRestarFinal
source: the difference of the sum of the digits in even positions and the ones in odd positions is a multiple of
es: la diferencia de la suma de las cifras en posiciones pares con la de las posiciones impares es múltiplo de

# CalculosValorUnoSumarPrincipio
source: is a divisor of {0} minus one
es: es divisor de {0} menos uno

# CalculosValorUnoSumarFinal
source: the sum of its digits is a multiple of
es: la suma de sus cifras es múltiplo de

# ReglaDivisorNegativoError
source: The divisor cannot be negative
es: El divisor no puede ser negativo

# ReglaBaseMenorError
source: The base must be greater than one
es: La base debe ser mayor que uno

# ReglaVaciaError
source: The given rule was empty
es: La regla recibida está vacía

# MensajeAplicarInicio
source: Applying the divisibility rule of {0} in base {1} to {2}, with {3} coefficients:
es: Aplicando la regla de divisibilidad de {0}, en base {1} a {2} con {3} coeficientes:

# MensajeAplicarSeparar
source: Step one: separate the number into two parts the right one has length {0}: Left: {1} Right: {2}
es: Separamos el número en dos partes, la derecha tendrá longitud {0}: Izquierda: {1} Derecha: {2}

# MensajeAplicarMultiplicarCoeficientes
source: Step two: multiply each digit in the right part by the coefficient in the same position:
es: Paso dos: multiplicar cada cifra de la parte derecha por el coeficiente en la misma posición:

# MensajeAplicarProductoCoeficiente
source: Results:
es: Resultados:

# MensajeAplicarSuma
source: Step three: add the sum of the products and the left part of the dividend:
es: Paso tres: Sumar las suma de los productos con la parte izquierda del dividendo:

# MensajeAplicarFin
source: {0} is divisible by {1}, therefore the original dividend, {2}, also is.
es: {0} es divisible entre {1}, por lo tanto, el dividendo original, {2}, también lo es.

# MensajeAplicarFinNoDivisible
source: {0} is not divisible by {1}, therefore the original dividend, {2}, also isn't.
es: {0} no es divisible entre {1}, por lo tanto, el dividendo original, {2}, tampoco lo es.

# MensajeAplicarFinPorTamaño
source: The divisibility of {0} is estimated to be easily calculated.
es: Se estima que la divisibilidad de {0} es fácil de calcular.

# MensajeAplicarMinimoEncontrado
source: The last dividend, {0}, was not lesser than the previous one, {1}. Two more iterations will be attempted.
es: El último dividendo, {0}, no ha sido menor que el anterior, {1}. Se harán dos iteraciones más antes de parar.

# MensajeAlfabetoNumericoExito
source: The numbers related to the dividend will be represented naturally in base {0} to facilitate reading using the following digits:
es: Los números relacionados con el dividendo se representarán en base {0} de forma natural para facilitar la lectura usando las siguientes cifras:

# MensajeAlfabetoNumericoExceso
source: The base is too large to represent naturally, numbers will be represented by the value of their digits in base ten.
es: La base es demasiado grande para representar los números de forma natural, se mostrarán con el valor de sus cifras en base diez.

# MensajeAplicarParteDerechaPequeña
source: The dividend, {0}, is to small for this rule, use the first coefficients, starting from the left.
es: El dividendo, {0}, es demasiado pequeño, use los primeros coeficientes desde la izquierda.

# ReglaExpliacadaCoeficientes
source: The dividend will be divisible by {0} if, and only if, the sum of the products of each coefficient with the digit from the dividend in base {1} in the same position, starting from the right removing each digit used, added to the rest of the rest of the dividend is divisible by {0}.
es: Aplique la regla como se especifica en el README con los coeficientes obtenidos

# ReglaExplicadaCero
source: No rule can be created, divisibility is not applicable with divisor zero.
es: No se puede crear ninguna regla, la divisibilidad no es aplicable con divisor cero.

# ReglaConstructorRestriccionCero
source: For this type, the divisor must be zero.
es: Para este tipo, el divisor debe ser cero.

# ReglaConstructorRestriccionUno
source: For this type, the divisor must be one.
es: Para este tipo, el divisor debe ser uno.

# ReglaExplicadaUno
source: No rule is necessary, all integers are divisible by one.
es: No es necesaria ninguna regla, todos los enteros son divisibles entre uno.

# ReglaExplicadaCifras
source: The dividend will be divisible by {0} if, and only if, its last {1} digits in base {2} are divisible by {0}.
es: El dividendo será divisible entre {0} si, y solo si, las últimas {1} cifras en base {2} son divisibles entre {0}.

# ReglaExplicadaSumar
source: The dividend will be divisible by {0} if, and only if, the sum of all the digits in base {1} split into groups of {2} digits, starting at its units digit is also divisible by {0}.
es: El dividendo será divisible entre {0} si, y solo si, la suma de las cifras en base {1} agrupadas en bloques de {2}, desde la de las unidades es divisible entre {0}.

# ReglaExplicadaRestar
source: The dividend will be divisible by {0} if, and only if, the difference of the sums of all the even and odd groups of digits in base {1} of {2} digits, starting at its units digit is also divisible by {0}.
es: El dividendo será divisible entre {0} si, y solo si, la resta de la suma de los grupos pares e impares de las cifras en base {1} de {2} cifras, desde la de las unidades, es divisible entre {0}.
